Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/court_offices/office_of_the_court_of_criminal_appeal.html.txt.tmx
Source language: en
Languages: ga

source: Office of the Court of Appeal – Criminal and Military
ga: Oifig na Cúirte Achomhairc – Choiriúil agus Míleata

source: The Office of the Court of Appeal:
ga: Bíonn Oifig na Cúirte Achomhairc:

source: • Provides administrative support to the Court of Appeal,
ga: • Ag cur tacaíocht riarthach ar fáil don Chúirt Achomhairc

source: • Processes appeals from decisions of the Central Criminal Court, the Circuit Criminal Court and the Special Criminal Court
ga: • Ag próiseáil achomhairc ó chinneadh de chuid na Cúirte Lárnach Coiriúil, na Cúirte Chuarda Choiriúil agus na Cúirte Speisialta Choiriúil

source: • Deals with courts martial appeals to the Court of Appeal
ga: • Ag láimhseáil achomhairc cúirt airm chuig Cúirt Achomhairc

source: Further information is available from the Office of the Court of Appeal for criminal and courts martial appeals
ga: Tá tuilleadh eolais ar fáil ó Oifig na Cúirte Achomhairc maidir le hachomhairc coiriúla agus cúirt airm
